 TEST:PROC OPTIONS(MAIN);

 DCL TEST_SETUP ENTRY;

 EXEC SQL BEGIN DECLARE SECTION;

   DCL USERPASS CHAR(28) VARYING INIT('f3tmax64/tmax@ORA12C');
   DCL RESULT_3 CHAR(3+1);
   DCL RESULT_4 CHAR(4+1);
   DCL RESULT_5 CHAR(5+1);

 EXEC SQL END DECLARE SECTION;

 CALL TEST_SETUP;

 EXEC SQL CONNECT :USERPASS;

 EXEC SQL
  SELECT BRANCH_CD INTO :RESULT_3 FROM BRANCH ORDER BY BRANCH_CD;
 DISPLAY(SQLCODE);
 DISPLAY(RESULT_3);

 EXEC SQL
  SELECT BRANCH_CD INTO :RESULT_4 FROM BRANCH ORDER BY BRANCH_CD;
 DISPLAY(SQLCODE);
 IF RESULT_4 = 'B001' || '00'X THEN
  DISPLAY('TRUE');

 END TEST;
