 TEST_SETUP:PROC;

 DCL CONN CHAR(30) INIT("f3tmax64/tmax@ORA12C");
 DCL CREATE_STR CHAR(100);
 DCL CREATE_STR2 CHAR(100);
 DCL CREATE_STR3 CHAR(100);

 DCL DELETE_STR CHAR(100);
 DCL DELETE_STR2 CHAR(100);
 DCL DELETE_STR3 CHAR(100);

 DCL INSERT_STR(3) CHAR(100);

 CREATE_STR = 'create table BRANCH ' ||
              '( BRANCH_CD CHAR(4),' ||
              '  POSTAL_CODE  CHAR(6),' ||
              '  REGION   VARCHAR(20)  ) ' || '00'X;

 CREATE_STR2 = "create table TEST_T (A INT)" || '00'X;
 CREATE_STR3 = "create table TEST_T2 (A INT)" || '00'X;

 DELETE_STR = "delete from BRANCH" || '00'X;
 DELETE_STR2 = "delete from TEST_T" || '00'X;
 DELETE_STR3 = "delete from TEST_T2" || '00'X;

 INSERT_STR(1) = 
       "insert into branch values ('B001', '717717', 'FRAME')" || '00'X;
 INSERT_STR(2) =
       "insert into branch values ('B002', '383719', 'BORAK')" || '00'X;
 INSERT_STR(3) =
       "insert into branch values ('B003', '425981', 'PSM')" || '00'X;

 EXEC SQL CONNECT :CONN;

 EXEC SQL EXECUTE IMMEDIATE :DELETE_STR;
 IF SQLCA.SQLCODE < 0 THEN
     EXEC SQL EXECUTE IMMEDIATE :CREATE_STR;

 EXEC SQL EXECUTE IMMEDIATE :DELETE_STR2;
 IF SQLCA.SQLCODE < 0 THEN
     EXEC SQL EXECUTE IMMEDIATE :CREATE_STR2;

 EXEC SQL EXECUTE IMMEDIATE :DELETE_STR3;
 IF SQLCA.SQLCODE < 0 THEN
     EXEC SQL EXECUTE IMMEDIATE :CREATE_STR3;

 DO I = 0 TO 2;
  EXEC SQL EXECUTE IMMEDIATE :INSERT_STR[I];
 END;

 EXEC SQL COMMIT;

 END TEST_SETUP;
